import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';

import '/config/locale/app_localizations.dart';
import '/core/utils/values/text_styles.dart';
import '/injection_container.dart';

class PrivacyPolicyScreen extends StatelessWidget {
  const PrivacyPolicyScreen({super.key});

  @override
  Widget build(BuildContext context) {
    bool isRtl = AppLocalizations.of(context)!.isArLocale;
    return Scaffold(
        appBar: AppBar(
          title: Container(
            width: ScreenUtil().screenWidth,
            alignment: isRtl ? Alignment.centerLeft : Alignment.centerRight,
            child: Text('privacy_policy'.tr),
          ),
          elevation: 4,
        ),
        body: Padding(
          padding: EdgeInsets.all(25.r),
          child: Column(
            children: [
              Expanded(
                child: Text(
                  'يعتبر تطبيق جزل مسوق وسيط الكتروني بين مستاجر السيارة ومزودي الخدمة (شركات التأجير) وسيبذل فريق جزل قصارى جهده بحسن نية لحماية حقوقك من خلال ارسال حجز سيارتك الى شركة تأجير السيارات، وقد تختلف الشروط والاحكام وفقاً لشركات تاجير السيارات فيرجى قرأتها بحذر حيث يمكنك الاطلاع عليها عند استلام السيارة. بأجراء حجز مع جزل فأنك تؤكد بأنك قرأت ووافقت على الشروط والاحكام بجانب سياسة الخصوصية الخاصة بنا، وقد نقوم بتغيير شروط وأحكام هذه الاتفاقية من وقت لآخر لذلك ننصحك بمراجعة الاتفاقية هذه بشكل دوري لمعرفة التغيرات التي تطرأ عليها.وفي حال كان هناك أي جزء غير مفهوم من هذه الاتفاقية، أو كان لديك أي استفسار حول تأجير السيارات أو أي خدمة مقدمة على تطبيق JZL يرجى التواصل معنا.لتعريفات تطبيق جزل : يقصد بهذه العبارة ادارة التطبيق سواءً كانت موقع إلكتروني أو تطبيق إلكتروني. أنت: هذه العبارة تشير إلى المستخدم لخدمات تطبيق جزل، أو الذي يقوم بالحجز، أو الذي يقوم بدفع المبلغ لقاء الخدمات المقدّمة على تطبيق جزل، أو السائق الرئيسي. كما يرجى ملاحظة أنّ كلمة "انت" قد تشير إلى أكثر من شخص. المستخدم/المستفيد/المستأجر: يقصد بهذه العبارة الشخص الذي يستفيد من الخدمات المقدمة على تطبيق جزل - سواء كان شخص طبيعي أو معنوي – ويشمل ذلك المستخدم/المستفيد الفرد أو مجموعة من المستخدمين/المستفيدين. الاتفاقية: يقصد بهذه العبارة اتفاقية الاستخدام هذه والتي تشمل الشروط والأحكام التي تنظم العلاقة بين أطراف الاتفاقية. الخدمات: يقصد بهذه العبارة جميع الخدمات المقدمة على تطبيق جزل بما فيها خدمات تأجير السيارات. ‏‎شركة التأجير: يقصد بهذه العبارة شركة تأجير السيارات والتي يقوم المستخدم أو المستفيد باختيارها عند إتمام عملية الحجز على تطبيق جزل. ‏‎الاستلام: موعد استلام السيارة من شركة التأجير والذي يقوم بتحديده المستخدم أو المستفيد. ‏‎التسليم: موعد تسليم السيارة لشركة التأجير والذي يقوم بتحديده المستخدم أو المستفيد. فتح الحساب والتسجيل على تطبيق جزل. ‏‎بإمكان أي شخص أن يقوم بفتح حساب على تطبيق جزل ، ولكي يتمكن من الحجز يجب أن يكون عمره تجاوز ٢١سنة و لديه رخصة قيادة سارية المفعول بما لا يقل عن 3 أشهر قبل تاريخ الانتهاء سواء كانت الرخصة سعودية أو دولية "تعتمد حسب سياسة شركة التأجير" وكذلك بشرط خلو سجل المستأجر من أي سجلات قضائية أو سوابق جنائية او تعثرات مالية، وعلى المستأجر تزويدنا بالبيانات الشخصية الخاصة به، وبالرغم من أنّ المستأجر يستطيع استخدام تطبيق جزل للتصفح إلا أنّه لا يمكنه إتمام عملية الحجز دون تقديم البيانات والمستندات اللازمة لذلك. ‏‎ المستندات والشروط المطلوبة لإتمام عملية الحجز: ‏‎لكي تتم عملية حجزك على تطبيق جزل.، يجب أن تكون مسجل في نظام "أبشر"، ولديك المستندات التالية: ‏‎• الهوية الشخصية ورخصة القيادة. ‏‎عند استلامك للسيارة لا بدّ أن تكون النسخة الأصلية من الهوية/ جواز السفر  مع رخصة القيادة متوفّرة لديك. و يجب أن تكون الهوية سارية المفعول لمدة لا تقل عن ٣ أشهر قبل تاريخ الانتهاء، و أن تكون  سليمة وفي حالة جيدة، كما سيتم مطابقة الاسم الظاهر على رخصة القيادة مع اسم مقدّم الحجز وذلك لضرورة أن تكون الرخصة المقدّمة باسم السائق الرئيسي، عدى ذلك فإنّ تطبيق جزل. غير مسؤول ولن يتم تعويضك عن أي خسائر أو مطالبات. ‏‎• بطاقة ائتمانية (Credit Card). ‏‎قد تطلب شركة تأجير السيارات بطاقة ائتمانية عند استلام السيارة لحجز مبلغ يحدد بناء على نوع السيارة ويسترد عند تسليمها بعد التأكد من سلامة السيارة وعدد الكيلومترات الإضافية وذلك وفقًا لأحكام وشروط شركة التأجير ولا يتحمل تطبيق جزل مسؤولية ذلك، وفي هذه الحالة يجب عليك تقديم بطاقة ائتمانية مطابقة لبيانات مقدّم الحجز، كما يجب أن تكون بيانات البطاقة التي تم الدفع بها أو البطاقة الائتمانية التي سيتم دفع رسوم مبلغ التأمين المسترد مطابقة لبيانات العميل المستأجر عن طريق التطبيق. ‏‎• السن المسموح به. ‏‎يجب ألّا يقل عمر السائق عن ٢١ عامًا، وفي بعض الشركات قد تطبق رسوم على من يقل عمره عن ٢٥ عامًا أو يزيد على ٦٥ عامًا او يتم الغاء الحجز ويعتمد ذلك حسب سياسة الشركة المؤجرة وقد يتم زيادة السن الادنى المسموح على السيارات الكبيرة والفارهة لدى  بعض الشركات، كما انه تنطبق عند بعض مزودي الخدمة .رسوم اضافية وتكون مدفوعة لدى شركة التاجير.',
                  style: TextStyles.regular14(
                    color: colors.main,
                  ),
                ),
              ),
            ],
          ),
        ));
  }
}
